import 'package:flutter/material.dart';
import 'package:pharmo_app/utilities/sizes.dart';
import 'package:pharmo_app/widgets/appbar/side_menu_appbar.dart';

class PrivacyPolicy extends StatelessWidget {
  const PrivacyPolicy({super.key});

  @override
  Widget build(BuildContext context) {
    final height = MediaQuery.of(context).size.height;
    final fs = height * .013;
    title({required String text}) {
      return Text(
        text,
        textAlign: TextAlign.left,
        style: TextStyle(fontSize: height * 0.018, fontWeight: FontWeight.bold),
      );
    }

    textArea({required String text}) {
      return Container(
        margin: const EdgeInsets.only(top: 4.0, left: 15, right: 15),
        padding: const EdgeInsets.all(5),
        decoration: BoxDecoration(
          color: theme.cardColor,
          borderRadius: BorderRadius.circular(10),
        ),
        child: Text(text, style: TextStyle(fontSize: fs, color: Colors.black)),
      );
    }

    return Scaffold(
      appBar: const SideAppBar(text: 'Нууцлалын бодлого'),
      body: SingleChildScrollView(
        padding: const EdgeInsets.symmetric(vertical: 10, horizontal: 15),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Column(
              crossAxisAlignment: CrossAxisAlignment.start,
              children: [
                title(text: '1. Танилцуулга'),
                textArea(
                    text:
                        'Энэхүү Нууцлалын бодлого нь Инфо-Системс ХХК-ийн удирддаг Pharmo.mn програмд ​​хамаарна. Энэ нь бид хэрэглэгчийн хувийн болон нууц мэдээллийг хэрхэн цуглуулж, ашиглаж, хуваалцдаг талаар тайлбарладаг. Бидний зорилго бол манай үйлчилгээнд нэвтрэхдээ ил тод байдал, хэрэглэгчийн нууцлалыг хангах явдал юм. Хэрэв танд асуух зүйл байвал pharmo2023@gmail.com хаягаар бидэнтэй холбогдоно уу.'),
                title(text: '2. Бидний цуглуулдаг өгөгдөл'),
                textArea(
                    text:
                        'Pharmo.mn нь дараах төрлийн хувийн болон эмзэг хэрэглэгчийн мэдээллийг цуглуулдаг.'),
                textArea(
                    text:
                        'Хувийн мэдээлэл: Нэр, имэйл хаяг, утасны дугаар, хүргэх хаяг.\n Дансны өгөгдөл: Имэйл хаяг, нууц үг (шифрлэгдсэн).\n Захиалгын мэдээлэл: Захиалсан бүтээгдэхүүн, захиалгын түүх, сонголт.\n Байршлын суурь өгөгдөл: Хэрэв та зөвшөөрөл өгвөл бид байршилд суурилсан үйлчилгээ, тухайлбал хүргэлтийг хянах, ойролцоох эмийн сангийн үйлчилгээг санал болгохын тулд байршлын мэдээллийг далд хэлбэрээр цуглуулдаг.\nЗөвшөөрөлтэйгөөр бид нийцтэй байдал, аюулгүй байдал болон ажиллагааг сайжруулахын тулд таны төхөөрөмж дээр суулгасан програмуудын мэдээллийг цуглуулдаг.'),
                title(text: '3. Хэрэглэгчийн мэдээллийг хэрхэн ашиглах вэ?'),
                textArea(text: 'Pharmo.mn цуглуулсан мэдээллийг дараах зорилгоор ашигладаг.'),
                textArea(
                    text:
                        'Захиалга боловсруулах, хүргэх. \nБайршилд суурилсан үйлчилгээ үзүүлэх (жишээ нь, түгээлтийг хянах).\nСуулгасан програмын мэдээлэлд хандах замаар програмын нийцтэй байдал, аюулгүй байдлыг баталгаажуулна.\nТаны захиалга, шинэчлэлт, саналын талаар тантай холбоо барина.\nХүргэлтийн үйлчилгээ үзүүлэгч эсвэл хуульд заасан нөхцөлөөс бусад тохиолдолд бид таны хувийн болон нууц мэдээллийг гуравдагч этгээдэд зарахгүй, хуваалцахгүй.'),
                textArea(text: 'Байршлын мэдээлэл цуглуулах зорилго:'),
                textArea(
                    text:
                        'Pharmo систем нь түгээлтийн явцын хурдан шуурхай, үр дүнтэй байдлыг хангах зорилгоор байршлын мэдээллийг цуглуулдаг. Энэ өгөгдөл нь зөвхөн нийлүүлэгч талын ажилтнууд болох борлуулагч болон түгээгчийн ажлыг хянах, захиалгын явцын өөрчлөлтийг цаг тухайд нь хүлээн авах боломжийг хангахад зайлшгүй шаардлагатай. Бодит цагийн (realtime) байршлын мэдээллийг хуваалцах замаар бид түгээлтийн үйл явцын уялдаа холбоо, ил тод, түргэн шуурхай байдлыг сайжруулахыг зорьж байна.'),
                textArea(text: 'Байршлын мэдээллийг дараах байдлаар цуглуулж, хуваалцана:'),
                textArea(
                    text:
                        'Түгээлтийн хувьд бид байршлын мэдээллийг апп нээлттэй байх (foreground) үед болон апп хаагдсан (background) үед зөвхөн түгээлтийн ажилтны одоогийн байршлыг бодит цаг хугацаанд (realtime) хянах боломжийг нийлүүлэгч талд олгох зорилгоор цуглуулна.Захиалагч талын хувьд өөрсдийн тухайн өдрийн түгээлтэнд гарсан захиалгын байршлыг буюу хаана явааг харах боломжийг ологохоос гадна аливаа учирсан саатлыг нэн даруй шийдвэрлэхэд тусална.Байршлын өгөгдлийг зөвхөн түгээлтийг хянахад зориулж ашигладаг бөгөөд хуульд зааснаас бусад тохиолдолд гуравдагч этгээдтэй хуваалцахгүй. Байршлын өгөгдлийг найдвартай хадгалж, түгээлтийн үйл ажиллагааг хэвийн хангахад зориулж ашиглана. Түгээлт дууссаны дараа тухайн түгээгчийн байршлын өгөгдлийг дамжуулахгүй.'),
                textArea(text: 'Байршлын өгөгдлийн хэрэглэгчийн хяналт:'),
                textArea(
                    text:
                        'Нийлүүлэгч талын ажилтан буюу Түгээгч байршлын мэдээлэл цуглуулахыг зөвшөөрөх эсэхээ өөрийн төхөөрөмжөөс тохируулах боломжтой ба байршлын зөвшөөрлийг хүссэн үедээ төхөөрөмжийнхөө тохиргоогоор дамжуулан идэвхгүй болгох боломжтой. Гэсэн хэдий ч байршлын үйлчилгээг идэвхгүй болгох нь тухайн аппликейшнд түгээлтийн хяналт, шинэчлэлтийг бодит цаг хугацаанд хянах боломжийг хязгаарлаж болзошгүй.Бид хэрэглэгчийн хувийн нууцыг хамгаалж, байршлын мэдээллийг зөвшөөрөлгүй нэвтрэхээс хамгаалахын тулд аюулгүй байдлын арга хэмжээг хэрэгжүүлэх үүрэгтэй. Бид зөвхөн дээр дурьдсан нөхцөл, зорилгоор байршлын мэдээллийг ашиглах бөгөөд холбогдох бүх мэдээллийг хуулийн дагуу хамгаална.'),
                title(text: '4. Мэдээлэл хуваалцах'),
                textArea(
                    text: 'Pharmo.mn нь хэрэглэгчийн мэдээллийг дараах хүмүүстэй хуваалцаж болно.'),
                textArea(
                    text:
                        'Үйлчилгээ үзүүлэгчид: Итгэмжлэгдсэн түншүүд нь хүргэлтийн үйлчилгээнд дуртай бөгөөд захиалгыг биелүүлэхийн тулд таны өгөгдөлд хандах шаардлагатай байдаг.Хуулийн шаардлага: Хууль, хууль эрх зүйн процесс эсвэл засгийн газрын эрх бүхий байгууллагаас шаардлагатай бол өгөгдлийг хуваалцаж болно.'),
                title(text: '5. Мэдээлэл хадгалах, устгах'),
                textArea(
                    text:
                        'Үйлчилгээ үзүүлэх, хууль ёсны үүргээ биелүүлэхэд шаардлагатай бол бид таны хувийн мэдээллийг хадгалдаг. Та дараах эрхтэй:'),
                textArea(
                    text:
                        'Өгөгдөлдөө хандахыг хүсэх.\nБуруу өгөгдлийг залруулах хүсэлт гаргах.\nХуулиар хадгалахыг шаарддагаас бусад тохиолдолд шаардлагагүй болсон тохиолдолд өгөгдлийг устгах хүсэлт гаргана уу.'),
                textArea(
                    text:
                        'Та эдгээр эрхээ contact@infosystems.mn болон pharmo2023@gmail.com хаягаар бидэнтэй холбогдож ашиглаж болно.'),
                title(text: '6. Аюулгүй байдал'),
                textArea(
                    text:
                        'Бид хувийн болон нууц мэдээллийг зөвшөөрөлгүй нэвтрэх, зөрчлөөс хамгаалахын тулд салбарын стандартын аюулгүй байдлын туршлагыг хэрэгжүүлдэг. Таны нэвтрэх мэдээлэл шифрлэгдсэн бөгөөд бид өгөгдлийг сервер дээрээ найдвартай хадгалах арга хэмжээ авдаг.'),
                title(text: '7. Нууцлалын бодлогын шинэчлэл'),
                textArea(
                    text:
                        'Энэхүү Нууцлалын бодлогыг үе үе шинэчилж болно. Хэрэглэгчдэд томоохон өөрчлөлтүүдийн талаар имэйлээр эсвэл апп дотор мэдэгдэх болно. Шинэчилсэн удирдамжийг апп болон веб дотроос үзэх боломжтой.'),
                title(text: '8. Холбоо барих мэдээлэл'),
                textArea(
                    text:
                        'Хэрэв танд энэхүү Нууцлалын бодлоготой холбоотой асуулт, санаа зовоосон зүйл байвал бидэнтэй холбогдоно уу:'),
                const Text(
                  'Инфо-Системс ХХК',
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
                const Text(
                  'Имэйл: contact@infosystems.mn, pharmo2023@gmail.com',
                  maxLines: 2,
                  style: TextStyle(fontWeight: FontWeight.w500, overflow: TextOverflow.fade),
                ),
                const Text(
                  'Утас: 70116399, 70126399, 91916549',
                  maxLines: 2,
                  style: TextStyle(fontWeight: FontWeight.w500, overflow: TextOverflow.fade),
                ),
                const SizedBox(height: kToolbarHeight)
              ],
            ),
          ],
        ),
      ),
    );
  }
}
