import 'package:flutter/material.dart';
import 'package:pharmo_app/widgets/appbar/custom_app_bar.dart';

class PrivacyPolicy extends StatelessWidget {
  const PrivacyPolicy({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: const CustomAppBar(
        title: Text(
          'Нууцлалын бодлого',
          style: TextStyle(
              color: Colors.black, fontSize: 18, fontWeight: FontWeight.bold),
        ),
      ),
      body: Container(
        padding: const EdgeInsets.symmetric(horizontal: 10),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              title(text: 'Нэг. Ерөнхий мэдээлэл, Мэдээлэл цуглуулах'),
              textArea(
                  text:
                      '1.1 Pharma.mn вэб сайт нь дараах тохиолдлуудад иргэн, хуулийн этгээдийг /цаашид “Хэрэглэгч”, “Захиалагч” гэх/ мэдээллийг цуглуулна. Үүнд: '),
              textArea(
                  text:
                      '1.2 Хэрэглэгч гэдэг нь Pharma.mn вэб сайтад нэвтэрч, өөрийн бүртгэлийг үүсгэн бараа бүтээгдэхүүн захиалж буй эмийн сангийн ажилтан, хуулийн этгээдийг хэлнэ.'),
              textArea(
                  text:
                      '1.3 Хэрэглэгч бүртгүүлэх үед и-мэйл хаяг болон хэрэглэгчийн үүсгэсэн нууц үг системд хадгалагдана. '),
              textArea(
                  text:
                      '1.4 Хэрэглэгчийн оруулсан нууц үгийг систем шифрлэн кодчилж хадгалах учир хэрэглэгчээс өөр хүн нууц үгийг мэдэх боломжгүй юм. '),
              textArea(
                  text:
                      '1.5 Хэрэглэгч хувийн мэдээллээ оруулах үед таны мэдээлэл (утас, мэйл хаяг,хаяг гэх мэт ерөнхий мэдээллүүд) системд хадгалагдана.'),
              textArea(
                  text:
                      '1.6 Хэрэглэгчийн системд хийсэн дараах үйлдлүүдийн мэдээлэл (таны хувийн мэдээлэл, захиалгын мэдээлэл, сонирхож буй бараа бүтээгдэхүүний мэдээлэл гэх мэт) системд хадгалагдана.'),
              title(text: 'Хоёр. Хэрэглэгчийн мэдээллийг хэрхэн ашиглах вэ?'),
              textArea(
                  text:
                      '2.1 Хэрэглэгчийн оруулсан мэдээлэл нь хэрэглэгчийн өмч бөгөөд “Инфо-Системс” ХХК хэрэглэгчийн зөвшөөрөлгүйгээр дор дурдсан нөхцөлөөс бусад хэлбэрээр ашиглахгүй болно.'),
              textArea(
                  text:
                      '2.2 Захиалсан бараа бүтээгдэхүүнийг хүргэх, захиалгатай холбоотой тодруулах зүйл гарсан тохиолдолд таны мэдээллийг дараах байдлаар ашиглана. Үүнд:'),
              textArea(
                  text:
                      '2.3 Таны гар утсанд холбогдох, и-мэйл хаяг руу мэдээлэл илгээх, хэрэглэгчийн бүртгүүлсэн хаягаар хүргэлт хийх гэх мэт.'),
              textArea(
                  text:
                      '2.4 Системийн ашиг тусын тулд системийн хяналт, сайжруулалт, хөгжүүлэлт, тест хийх, шинэ бүтээгдэхүүн ба модуль хөгжүүлэх болон тест хийх, техникийн засвар хийх'),
              title(text: 'Гурав. Хэрэглэгчийн мэдээллийг бусдад түгээх'),
              textArea(
                  text:
                      '3.1 “Инфо-Системс” ХХК нь хэрэглэгчийн хувийн мэдээллийг гуравдагч этгээдэд ашиглуулахгүй, түгээхгүй бөгөөд үйлчилгээний хэрэгцээнээс гадуур аливаа зорилгоор ашиглахгүй болно.'),
              title(text: 'Дөрөв. Хэрэглэгчийн мэдээллийг хадгалах'),
              textArea(
                  text:
                      '4.1 “Инфо-Системс” ХХК нь хэрэглэгчийн оруулсан мэдээллийг Virtual.mn дээрх өөрийн серверт хадгална. '),
              textArea(
                  text:
                      '4.2 Хэрэглэгч системд нэвтрэх нэр, нууц үгээ аюулгүй хадгалах нь хэрэглэгчийн анхаарах зүйл юм. '),
              textArea(
                  text:
                      '4.3 Нэвтрэх эрхээ бусдад алдсанаас үүдэлтэй таны хуудаст үүссэн аливаа хор, хохирлыг “Инфо-Системс” ХХК хариуцахгүй бөгөөд “Инфо-Системс” ХХК нь таны хандах эрхийг ашиглан таны мэдээлэлд нэвтрэх боломжгүй болно.'),
              title(text: 'Тав. Нууцлалын баталгааны журмын шинэчлэлт'),
              textArea(
                  text:
                      '5.1 Энэхүү “Нууцлалын баталгаа”-ны заалтууд нь өөрчлөгдөх боломжтой. '),
              textArea(
                  text:
                      '5.2 Хэрэв Pharma.mn худалдааны “Нууцлалын баталгаа” өөрчлөгдөх, шинэчлэгдэх тохиолдолд Хэрэглэгчийн бүртгүүлсэн цахим хаяг руу тухай бүрд нь мэдээлэл явуулж танилцуулж байна.'),
              textArea(
                  text:
                      '5.3 Хэрэглэгчийг захиалга хийгдэх үед хүчинтэй байсан “Нууцлалын баталгаа” захиалга хүлээж авах хугацаанд өөрчлөгдсөн тохиолдолд өмнөх “Нууцлалын баталгаа”-г бараа хүлээж авах хүртэлх хугацаанд хүчинтэйд тооцох болно.')
            ],
          ),
        ),
      ),
    );
  }

  title({required String text}) {
    return Text(
      text,
      style: const TextStyle(fontSize: 18, fontWeight: FontWeight.bold),
    );
  }

  textArea({required String text}) {
    return Container(
      margin: const EdgeInsets.only(top: 4.0, left: 30, right: 15),
      decoration: BoxDecoration(
        color: Colors.white,
        borderRadius: BorderRadius.circular(10),
      ),
      child:
          Text(text, style: const TextStyle(fontSize: 14, color: Colors.black)),
    );
  }
}
