import 'package:flutter/material.dart';
import 'package:pharmo_app/utilities/colors.dart';
import 'package:pharmo_app/widgets/appbar/custom_app_bar.dart';

class PrivacyPolicy extends StatelessWidget {
  const PrivacyPolicy({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: const CustomAppBar(
        title: Text(
          'Нууцлалын бодлого',
          style: TextStyle(
              color: Colors.black, fontSize: 14, fontWeight: FontWeight.bold),
        ),
      ),
      body: Container(
        padding: const EdgeInsets.symmetric(horizontal: 10),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              title(text: 'Ерөнхий:'),
              textArea(
                  text:
                      'Энэхүү нууцлалын бодлого нь Info Systems үнэгүй үйлчилгээ хэлбэрээр үүсгэсэн гар утасны төхөөрөмжүүдэд зориулсан Pharmo програмд хамаарна.'),
              textArea(
                  text:
                      'Энэ үйлчилгээ нь "Pharmo Апп"-ийг ашиглахад зориулагдсан.'),
              textArea(
                  text:
                      'Мэдээлэл цуглуулах, ашиглах Аппликейшн нь таныг татаж аваад ашиглах үед мэдээлэл цуглуулдаг.'),
              textArea(text: 'Энэ мэдээлэлд зэрэг мэдээлэл багтаж болно. '),
              textArea(
                  text:
                      'Таны зочилсон програмын хуудсууд, зочилсон цаг, огноо, тэдгээр хуудсанд зарцуулсан цаг Өргөдөл гаргахад зарцуулсан хугацаа.'),
              textArea(
                  text:
                      ' Таны мобайл төхөөрөмж дээр ашигладаг үйлдлийн систем Аппликешн нь таны мобайл төхөөрөмжийн байршлын талаар нарийн мэдээлэл цуглуулдаг.'),
              textArea(
                  text:
                      'Аппликейшнийг ашиглах явцад илүү сайн туршлага олж авахын тулд үйлчилгээ үзүүлэгч танаас pharmo2023@gmail.com гэх мэт тодорхой хувийн мэдээллийг өгөхийг шаардаж болно.'),
              textArea(
                  text:
                      ' Үйлчилгээ үзүүлэгчийн хүсэлтийн талаарх мэдээллийг тэдгээрт хадгалж, энэхүү нууцлалын бодлогод заасны дагуу ашиглах болно.'),
              textArea(
                  text:
                      'Гуравдагч этгээдийн хандалт Үйлчилгээ үзүүлэгчийг Аппликейшн болон тэдгээрийн үйлчилгээг сайжруулахад туслах зорилгоор зөвхөн нэгтгэсэн, нэрээ нууцалсан өгөгдлийг үе үе гадны үйлчилгээнд дамжуулдаг.'),
              textArea(
                  text:
                      'Үйлчилгээ үзүүлэгч нь энэхүү нууцлалын мэдэгдэлд заасан байдлаар таны мэдээллийг гуравдагч этгээдтэй хуваалцаж болно.'),
              textArea(
                  text:
                      'Аппликешн нь өгөгдөлтэй харьцах өөрийн Нууцлалын бодлоготой гуравдагч талын үйлчилгээг ашигладаг болохыг анхаарна уу.'),
              textArea(
                  text:
                      'Аппликешн ашигладаг гуравдагч талын үйлчилгээ үзүүлэгчдийн Нууцлалын бодлогын холбоосыг доор харуулав.'),
              title(
                  text:
                      'Google Play үйлчилгээ Firebase-д зориулсан Google Analytics:'),
              textArea(
                  text:
                      'Үйлчилгээ үзүүлэгч нь хэрэглэгчийн өгсөн болон автоматаар цуглуулсан мэдээллийг задруулж болно.'),
              textArea(
                  text:
                      ' Хууль тогтоомжийн дагуу, тухайлбал, зарлан дуудах хуудас, түүнтэй адилтгах хуулийн процессыг биелүүлэх. '),
              textArea(
                  text:
                      'Тэдний эрхийг хамгаалах, таны болон бусдын аюулгүй байдлыг хамгаалах, залилан мэхлэх гэмт хэргийг мөрдөн шалгах, засгийн газрын хүсэлтэд хариу өгөхийн тулд ил тод болгох шаардлагатай гэдэгт итгэлтэй байх үед.'),
              textArea(
                  text:
                      'Тэдний нэрийн өмнөөс ажилладаг итгэмжлэгдсэн үйлчилгээ үзүүлэгчтэй, бидний тэдэнд өгсөн мэдээллийг бие даан ашигладаггүй бөгөөд энэхүү нууцлалын мэдэгдэлд заасан дүрмийг дагаж мөрдөхийг зөвшөөрсөн.'),
              textArea(
                  text:
                      'Татгалзах эрх Аппликешныг устгаснаар та бүх мэдээллийн цуглуулгыг хялбархан зогсоож болно. '),
              textArea(
                  text:
                      'Та гар утасныхаа нэг хэсэг эсвэл гар утасны програмын зах зээл эсвэл сүлжээгээр ашиглах боломжтой стандарт устгах процессуудыг ашиглаж болно.'),
              textArea(
                  text:
                      'Мэдээлэл хадгалах бодлого Үйлчилгээ үзүүлэгч нь таныг Аппликешныг ашиглах болон түүнээс хойш боломжийн хугацаанд хэрэглэгчийн өгсөн өгөгдлийг хадгалах болно.'),
              textArea(
                  text:
                      'Хэрэв та тэднийг Аппликейшнээр дамжуулан өгсөн хэрэглэгчийн өгсөн өгөгдлийг устгахыг хүсвэл pharmo2023@gmail.com хаягаар холбогдоно уу, тэд боломжийн хугацаанд хариу өгөх болно.'),
              title(text: 'Насны хязгаарлалт:'),
              textArea(
                  text:
                      'Хүүхдүүд Үйлчилгээ үзүүлэгч нь 13-аас доош насны хүүхдүүдээс мэдээлэл авах эсвэл зах зээлд гаргах зорилгоор уг програмыг ашигладаггүй.'),
              textArea(text: 'Өргөдөл нь 13-аас доош насны хэнд ч ханддаггүй.'),
              textArea(
                  text:
                      ' Үйлчилгээ үзүүлэгч нь 13-аас доош насны хүүхдүүдээс хувийн мэдээллийг цуглуулдаггүй.'),
              textArea(
                  text:
                      'Үйлчилгээ үзүүлэгч 13-аас доош насны хүүхэд хувийн мэдээлэл өгсөн болохыг олж мэдсэн тохиолдолд Үйлчилгээ үзүүлэгч үүнийг серверээс нь нэн даруй устгах болно. '),
              textArea(
                  text:
                      'Хэрэв та эцэг эх, асран хамгаалагч бөгөөд таны хүүхэд бидэнд хувийн мэдээлэл өгсөн гэдгийг мэдэж байгаа бол үйлчилгээ үзүүлэгчтэй (pharmo2023@gmail.com) холбогдож шаардлагатай арга хэмжээг авах боломжтой болно.'),
              title(text: 'Бусад:'),
              textArea(
                  text:
                      'Аюулгүй байдал Үйлчилгээ үзүүлэгч таны мэдээллийн нууцлалыг хамгаалах талаар санаа зовж байна. Үйлчилгээ үзүүлэгч нь үйлчилгээ үзүүлэгчийн боловсруулж, хадгалж буй мэдээллийг хамгаалахын тулд биет, цахим болон процедурын хамгаалалтыг хангадаг.'),
              textArea(
                  text:
                      'Өөрчлөлтүүд Энэхүү Нууцлалын бодлогыг ямар ч шалтгаанаар үе үе шинэчилж болно.'),
              textArea(
                  text:
                      ' Үйлчилгээ үзүүлэгч энэ хуудсыг шинэ нууцлалын бодлогоор шинэчлэх замаар нууцлалын бодлогод гарсан аливаа өөрчлөлтийн талаар танд мэдэгдэх болно.'),
              textArea(
                  text:
                      'Үргэлжлүүлэн ашиглах нь бүх өөрчлөлтийг зөвшөөрсөнд тооцогдох тул аливаа өөрчлөлтийн талаар энэхүү нууцлалын бодлоготой тогтмол танилцахыг зөвлөж байна'),
              textArea(
                  text:
                      'Энэхүү нууцлалын бодлого нь 2024-09-10-ны өдрөөс эхлэн хүчин төгөлдөр болно. '),
              textArea(
                  text:
                      'Таны зөвшөөрөл Аппликешныг ашигласнаар та энэхүү нууцлалын бодлогод тусгагдсан болон бидний оруулсан нэмэлт өөрчлөлтийн дагуу өөрийн мэдээллийг боловсруулахыг зөвшөөрч байна.'),
              title(text: 'Бидэнтэй холбоо барих'),
              textArea(
                  text:
                      'Хэрэв танд Аппликешныг ашиглах явцад хувийн нууцтай холбоотой асуулт байвал эсвэл үйл ажиллагааны талаар асуулт байвал pharmo2023@gmail.com хаягаар үйлчилгээ үзүүлэгчтэй холбогдоно уу.'),
            ],
          ),
        ),
      ),
    );
  }

  title({required String text}) {
    return Text(
      text,
      style: const TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
    );
  }

  textArea({required String text}) {
    return Container(
      padding: const EdgeInsets.all(5),
      margin: const EdgeInsets.symmetric(vertical: 5),
      decoration: BoxDecoration(
        color: Colors.white,
        borderRadius: BorderRadius.circular(10),
        border: Border.all(color: AppColors.primary),
      ),
      child:
          Text(text, style: const TextStyle(fontSize: 14, color: Colors.black)),
    );
  }
}
