import 'package:flutter/material.dart';
import 'package:pharmo_app/widgets/ui_help/box.dart';
import 'package:pharmo_app/widgets/ui_help/default_box.dart';

class PrivacyPolicy extends StatelessWidget {
  const PrivacyPolicy({super.key});

  @override
  Widget build(BuildContext context) {
    final height = MediaQuery.of(context).size.height;
    final theme = Theme.of(context);
    final fs = height * .013;
    title({required String text}) {
      return Text(
        text,
        style: TextStyle(fontSize: height * 0.018, fontWeight: FontWeight.bold),
      );
    }

    textArea({required String text}) {
      return Container(
        margin: const EdgeInsets.only(top: 4.0, left: 30, right: 15),
        padding: const EdgeInsets.all(5),
        decoration: BoxDecoration(
          color: theme.cardColor,
          borderRadius: BorderRadius.circular(10),
        ),
        child: Text(text, style: TextStyle(fontSize: fs, color: Colors.black)),
      );
    }

    return Scaffold(
      backgroundColor: Theme.of(context).scaffoldBackgroundColor,
      extendBody: true,
      body: DefaultBox(
        title: 'Нууцлалын бодлого',
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Box(
                child: Column(
                  children: [
                    title(text: 'Нэг. Ерөнхий мэдээлэл, Мэдээлэл цуглуулах'),
                    textArea(
                        text:
                            '1.1 Pharmo.mn вэб сайт нь дараах тохиолдлуудад иргэн, хуулийн этгээдийг /цаашид “Хэрэглэгч”, “Захиалагч” гэх/ мэдээллийг цуглуулна. Үүнд: '),
                    textArea(
                        text:
                            '1.2 Хэрэглэгч гэдэг нь Pharmo.mn вэб сайтад нэвтэрч, өөрийн бүртгэлийг үүсгэн бараа бүтээгдэхүүн захиалж буй эмийн сангийн ажилтан, хуулийн этгээдийг хэлнэ.'),
                    textArea(
                        text:
                            '1.3 Хэрэглэгч бүртгүүлэх үед и-мэйл хаяг болон хэрэглэгчийн үүсгэсэн нууц үг системд хадгалагдана. '),
                    textArea(
                        text:
                            '1.4 Хэрэглэгчийн оруулсан нууц үгийг систем шифрлэн кодчилж хадгалах учир хэрэглэгчээс өөр хүн нууц үгийг мэдэх боломжгүй юм. '),
                    textArea(
                        text:
                            '1.5 Хэрэглэгч хувийн мэдээллээ оруулах үед таны мэдээлэл (утас, мэйл хаяг,хаяг гэх мэт ерөнхий мэдээллүүд) системд хадгалагдана.'),
                    textArea(
                        text:
                            '1.6 Хэрэглэгчийн системд хийсэн дараах үйлдлүүдийн мэдээлэл (таны хувийн мэдээлэл, захиалгын мэдээлэл, сонирхож буй бараа бүтээгдэхүүний мэдээлэл гэх мэт) системд хадгалагдана.'),
                  ],
                ),
              ),
              Box(
                child: Column(
                  children: [
                    title(
                        text:
                            'Хоёр. Хэрэглэгчийн мэдээллийг хэрхэн ашиглах вэ?'),
                    textArea(
                        text:
                            '2.1 Хэрэглэгчийн оруулсан мэдээлэл нь хэрэглэгчийн өмч бөгөөд “Инфосистемс” ХХК хэрэглэгчийн зөвшөөрөлгүйгээр дор дурдсан нөхцөлөөс бусад хэлбэрээр ашиглахгүй болно.'),
                    textArea(
                        text:
                            '2.2 Захиалсан бараа бүтээгдэхүүнийг хүргэх, захиалгатай холбоотой тодруулах зүйл гарсан тохиолдолд таны мэдээллийг дараах байдлаар ашиглана. Үүнд:'),
                    textArea(
                        text:
                            '2.3 Таны гар утсанд холбогдох, и-мэйл хаяг руу мэдээлэл илгээх, хэрэглэгчийн бүртгүүлсэн хаягаар хүргэлт хийх гэх мэт.'),
                    textArea(
                        text:
                            '2.4 Системийн ашиг тусын тулд системийн хяналт, сайжруулалт, хөгжүүлэлт, тест хийх, шинэ бүтээгдэхүүн ба модуль хөгжүүлэх болон тест хийх, техникийн засвар хийх'),
                  ],
                ),
              ),
              Box(
                child: Column(
                  children: [
                    title(text: 'Гурав. Хэрэглэгчийн мэдээллийг бусдад түгээх'),
                    textArea(
                        text:
                            '3.1 “Инфосистемс” ХХК нь хэрэглэгчийн хувийн мэдээллийг гуравдагч этгээдэд ашиглуулахгүй, түгээхгүй бөгөөд үйлчилгээний хэрэгцээнээс гадуур аливаа зорилгоор ашиглахгүй болно.'),
                  ],
                ),
              ),
              Box(
                child: Column(
                  children: [
                    title(text: 'Дөрөв. Хэрэглэгчийн мэдээллийг хадгалах'),
                    textArea(
                        text:
                            '4.1 “Инфосистемс” ХХК нь хэрэглэгчийн оруулсан мэдээллийг Virtual.mn дээрх өөрийн серверт хадгална. '),
                    textArea(
                        text:
                            '4.2 Хэрэглэгч системд нэвтрэх нэр, нууц үгээ аюулгүй хадгалах нь хэрэглэгчийн анхаарах зүйл юм. '),
                    textArea(
                        text:
                            '4.3 Нэвтрэх эрхээ бусдад алдсанаас үүдэлтэй таны хуудаст үүссэн аливаа хор, хохирлыг “Инфосистемс” ХХК хариуцахгүй бөгөөд “Инфосистемс” ХХК нь таны хандах эрхийг ашиглан таны мэдээлэлд нэвтрэх боломжгүй болно.'),
                  ],
                ),
              ),
              Box(
                child: Column(
                  children: [
                    title(text: 'Тав.нэг. Байршлын мэдээлэл цуглуулах зорилго'),
                    textArea(
                        text:
                            '5.1.1 “Pharmo програм нь эмийн захиалгын бодит цагийн хяналт, үр дүнтэй хүргэлтийг дэмжихийн тулд байршлын мэдээллийг цуглуулдаг.'),
                    textArea(
                        text:
                            '5.1.2 Энэ өгөгдөл нь борлуулагч байгууллагын хүргэлтийн ажилтнууд хүргэлтийн явцыг үнэн зөв харж, захиалгын байдлын талаарх шинэчлэлтийг цаг тухайд нь хүлээн авах боломжийг хангахад зайлшгүй шаардлагатай. Бодит цагийн байршлын мэдээллийг хуваалцах замаар бид хүргэх үйл явцад оролцож буй бүх хүмүүсийн уялдаа холбоо, ил тод байдлыг сайжруулахыг зорьж байна.'),
                    title(
                        text:
                            'Тав.хоёр. Байршлын мэдээллийг дараах байдлаар цуглуулж, хуваалцана'),
                    textArea(
                        text:
                            '5.2.1 Хүргэлтийн ажилтнуудын хувьд бид байршлын мэдээллийг урд талд (апп нээлттэй байх үед) болон ар талд (апп хаагдсан эсвэл ашиглагдаагүй үед) зөвхөн эмийн сан, дистрибьютерийг үнэн зөв, бодит цаг хугацаанд нь хангах зорилгоор цуглуулдаг.'),
                    textArea(
                        text:
                            '5.2.2 Борлуулагч байгууллагын ажилтнууд болон дистрибьютерүүд тээвэрлэж буй захиалгын байршлыг харж, цаг тухайд нь хүргэх, болзошгүй саатлыг нэн даруй шийдвэрлэхэд тусална.'),
                    title(text: 'Тав.гурав. Мэдээлэл хуваалцах ба хадгалах'),
                    textArea(
                        text:
                            ' 5.3.1 Байршлын өгөгдлийг зөвхөн хүргэлтийн зохицуулалтад зориулж апп дотор ашигладаг бөгөөд хуульд зааснаас бусад тохиолдолд гуравдагч этгээдтэй хуваалцахгүй. Байршлын өгөгдлийг найдвартай хадгалж, хүргэх үйл ажиллагааг дэмжихэд шаардлагатай хугацаанд л хадгална. Хүргэлт дууссаны дараа тухайн захиалгын байршлын өгөгдлийг идэвхтэй хянахаа больсон.'),
                    title(
                        text:
                            'Тав.дөрөв. Байршлын өгөгдлийн хэрэглэгчийн хяналт'),
                    textArea(
                        text:
                            '5.4.1 Хэрэглэгчид байршлын мэдээлэл цуглуулахыг зөвшөөрөх эсэхээ хянах боломжтой ба байршлын зөвшөөрлийг хүссэн үедээ төхөөрөмжийн тохиргоогоор дамжуулан идэвхгүй болгох боломжтой. Гэсэн хэдий ч байршлын үйлчилгээг идэвхгүй болгох нь тухайн аппликейшнд хүргэлтийн хяналт, шинэчлэлтийг бодит цаг хугацаанд хийх чадварт нөлөөлж болзошгүй.'),
                  ],
                ),
              ),
              Box(
                child: Column(
                  children: [
                    title(
                        text: 'Зургаа. Нууцлалын баталгааны журмын шинэчлэлт'),
                    textArea(
                        text:
                            '6.1 Энэхүү “Нууцлалын баталгаа”-ны заалтууд нь өөрчлөгдөх боломжтой. '),
                    textArea(
                        text:
                            '6.2 Хэрэв Pharmo.mn худалдааны “Нууцлалын баталгаа” өөрчлөгдөх, шинэчлэгдэх тохиолдолд Хэрэглэгчийн бүртгүүлсэн цахим хаяг руу тухай бүрд нь мэдээлэл явуулж танилцуулж байна.'),
                    textArea(
                        text:
                            '6.3 Хэрэглэгчийг захиалга хийгдэх үед хүчинтэй байсан “Нууцлалын баталгаа” захиалга хүлээж авах хугацаанд өөрчлөгдсөн тохиолдолд өмнөх “Нууцлалын баталгаа”-г бараа хүлээж авах хүртэлх хугацаанд хүчинтэйд тооцох болно.')
                  ],
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
